# Combine (Join) Operations

In [27]:
import numpy as np
import pandas as pd
m = np.random.randint(1, 30, size = (5, 3))
df1 = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df1

   var1  var2  var3
0    11    18    15
1     8     7    14
2     5    17     6
3     1    25     4
4     7    21     1

In [28]:
df2 = df1 ** 2

In [29]:
df2

   var1  var2  var3
0   121   324   225
1    64    49   196
2    25   289    36
3     1   625    16
4    49   441     1

In [30]:
pd.concat([df1, df2])

   var1  var2  var3
0    11    18    15
1     8     7    14
2     5    17     6
3     1    25     4
4     7    21     1
0   121   324   225
1    64    49   196
2    25   289    36
3     1   625    16
4    49   441     1

In [37]:
df = pd.concat([df1, df2], ignore_index = True)

In [38]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [39]:
df.columns.dtype

dtype('O')

In [40]:
df.values

array([[ 11,  18,  15],
       [  8,   7,  14],
       [  5,  17,   6],
       [  1,  25,   4],
       [  7,  21,   1],
       [121, 324, 225],
       [ 64,  49, 196],
       [ 25, 289,  36],
       [  1, 625,  16],
       [ 49, 441,   1]])

In [41]:
df.values.dtype

dtype('int32')

In [42]:
df2.columns = ["var1", "var2", "deg3"]

In [46]:
pd.concat([df1, df2])

   var1  var2  var3   deg3
0    11    18  15.0    NaN
1     8     7  14.0    NaN
2     5    17   6.0    NaN
3     1    25   4.0    NaN
4     7    21   1.0    NaN
0   121   324   NaN  225.0
1    64    49   NaN  196.0
2    25   289   NaN   36.0
3     1   625   NaN   16.0
4    49   441   NaN    1.0

### Inner Join

In [45]:
pd.concat([df1, df2], join="inner")

   var1  var2
0    11    18
1     8     7
2     5    17
3     1    25
4     7    21
0   121   324
1    64    49
2    25   289
3     1   625
4    49   441